diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбоненскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
///начало доработки Барышникова Ю.А 08.11.2024
#Область ОписаниеПеременных
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	Если  НЕ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда  
		Элементы.ВКМ_НачалоДействияДоговора.Видимость =  Ложь ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость =  Ложь ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =  Ложь ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =  Ложь ; 
	Иначе 	
		Элементы.ВКМ_НачалоДействияДоговора.Видимость =  Истина ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость =  Истина ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =  Истина ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =  Истина ; 
	КонецЕсли ;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание И 
	    Не ЗначениеЗаполнено(Объект.ВКМ_НачалоДействияДоговора)Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указана дата начала договора";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли ;

	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание И
		НЕ ЗначениеЗаполнено(Объект.ВКМ_КонецДействияДоговора) Тогда
		Сообщение = Новый СообщениеПользователю() ;
		Сообщение.Текст ="Не указана дата окончания договора" ;
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВКМ_НачалоДействияДоговора.Видимость =Ложь;
	Элементы.ВКМ_КонецДействияДоговора.Видимость =Ложь;
	Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =Ложь;
	Если Объект.ВидДоговора =  Перечисления .ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда  
		Элементы.ВКМ_НачалоДействияДоговора.Видимость =  Истина ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость =  Истина ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =  Истина ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =  Истина ; 
	КонецЕсли ;
КонецПроцедуры	
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
